## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
ecs.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        RESOURCE                         |
|----------|---------------------------------------------------------|
| update   | `module.celery_beat_ecs.aws_ecs_service.this`           |
|          | `module.celery_worker_ecs.aws_ecs_service.this`         |
|          | `module.superset_ecs.aws_ecs_service.this`              |
| recreate | `module.celery_beat_ecs.aws_ecs_task_definition.this`   |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this` |
|          | `module.superset_ecs.aws_ecs_task_definition.this`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.celery_beat_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-beat"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-beat:23" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-beat:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    command                = [
                        "/app/docker/docker-bootstrap.sh",
                        "beat",
                    ]
                    environment            = [
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "cds-redis.wv1cbb.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        {
                            name  = "SUPERSET_DATABASE_DB"
                            value = "superset"
                        },
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                        {
                            name  = "WEBDRIVER_BASEURL"
                            value = "https://superset.cdssandbox.xyz"
                        },
                    ]
                    essential              = true
                    image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/superset/celery-beat"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "celery-beat"
                    portMappings           = [
                        {
                            containerPort = 8088
                            hostPort      = 8088
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "SUPERSET_DATABASE_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host"
                        },
                        {
                            name      = "SUPERSET_DATABASE_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password"
                        },
                        {
                            name      = "SUPERSET_DATABASE_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username"
                        },
                        {
                            name      = "SUPERSET_SECRET_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-worker"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-worker:23" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    command                = [
                        "/app/docker/docker-bootstrap.sh",
                        "worker",
                    ]
                    environment            = [
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "cds-redis.wv1cbb.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        {
                            name  = "SUPERSET_DATABASE_DB"
                            value = "superset"
                        },
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                        {
                            name  = "WEBDRIVER_BASEURL"
                            value = "https://superset.cdssandbox.xyz"
                        },
                    ]
                    essential              = true
                    image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/superset/celery-worker"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "celery-worker"
                    portMappings           = [
                        {
                            containerPort = 8088
                            hostPort      = 8088
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "SUPERSET_DATABASE_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host"
                        },
                        {
                            name      = "SUPERSET_DATABASE_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password"
                        },
                        {
                            name      = "SUPERSET_DATABASE_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username"
                        },
                        {
                            name      = "SUPERSET_SECRET_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ cpu                      = "1024" -> "2048" # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-worker" -> (known after apply)
      ~ memory                   = "2048" -> "4096" # forces replacement
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.superset_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "superset"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "superset:25" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    command                = [
                        "/app/docker/docker-bootstrap.sh",
                        "app",
                    ]
                    environment            = [
                        {
                            name  = "GOOGLE_AUTH_DOMAIN"
                            value = "superset.cdssandbox.xyz"
                        },
                        {
                            name  = "GOOGLE_OAUTH_EMAIL_DOMAIN"
                            value = "cds-snc.ca"
                        },
                        {
                            name  = "GOOGLE_OAUTH_LOGIN"
                            value = "true"
                        },
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "cds-redis.wv1cbb.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        {
                            name  = "SUPERSET_DATABASE_DB"
                            value = "superset"
                        },
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                        {
                            name  = "WEBDRIVER_BASEURL"
                            value = "https://superset.cdssandbox.xyz"
                        },
                    ]
                    essential              = true
                    image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/superset/superset"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "superset"
                    portMappings           = [
                        {
                            containerPort = 8088
                            hostPort      = 8088
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_ID"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_id"
                        },
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_SECRET"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/google_oauth_client_secret"
                        },
                        {
                            name      = "SUPERSET_DATABASE_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_host"
                        },
                        {
                            name      = "SUPERSET_DATABASE_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_password"
                        },
                        {
                            name      = "SUPERSET_DATABASE_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_database_username"
                        },
                        {
                            name      = "SUPERSET_SECRET_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:257394494478:parameter/superset_secret_key"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "superset" -> (known after apply)
      ~ memory                   = "8192" -> "4096" # forces replacement
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
